app/Controllers/Admin.php

    public function dashboard()
    {
        echo view('Admin/Layouts/header');
        $employeemodel= new employeeModel();
        $data['totalEmployees']=$employeemodel->countAll();

        $employeemodel= new Food_model();
        $data['totalcounts'] = $employeemodel->where('available', 'yes')->countAllResults();

        $reservationmodel= new Reservation_model();
      $data['totalReservations'] = $reservationmodel->where('available', 'yes')->countAllResults();

      $contactmodel= new ContactModel();
      $data['totalContacts']=$contactmodel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `employees`
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `available` = 'yes'
SELECT COUNT(*) AS `numrows` FROM `contact`

    public function employee()
    {
         echo view('Admin/Layouts/header');
        $employeemodel= new employeeModel();
        $data['employee']=$employeemodel->findAll();
---
SELECT *
FROM `employees`

    public function update($id)
    {

        $model= new employeeModel();
        $prod_item = $model->find($id);

        $data = [
            'name'  => $this->request->getpost('name'),
            'email' => $this->request->getpost('email'),
            'phone'  => $this->request->getpost('phone'),
            'address'=>$this->request->getPost('address'),
            'joining_date'=>$this->request->getPost('joining_date'),


        ];

        $model->update($id,$data);
---
UPDATE `employees` SET `name` = 'Roshan', `email` = 'roshan@gmail.com', `phone` = '8291392598', `address` = 'Mankhurd Mumbai', `joining_date` = '2023-12-23'
WHERE `employees`.`id` IN ('7')

    public function contact()
    {
        echo view('Admin/Layouts/header');
        $contactmodel= new ContactModel();
        $data['contact']=$contactmodel->findAll();
---
SELECT *
FROM `contact`