app/Controllers/Food.php

    public function index()
    {  echo view('Admin/Layouts/header');
        $foodModel = new Food_model();
        $data['foods'] = $foodModel->findAll();
---
SELECT *
FROM `foods`